import pandas as pd
import pytest


# Фикстура для создания DataFrame с операциями
@pytest.fixture
def operations_data() -> pd.DataFrame:
    data = {
        "Дата операции": [
            "30.12.2021 17:50:17",
            "30.12.2021 14:48:25",
            "29.12.2021 22:32:24",
            "29.12.2021 22:28:47",
            "29.12.2021 16:22:08",
        ],
        "Номер карты": ["*4556", "*7197", "*4556", "*4556", "*5091"],
        "Сумма операции": [174000.0, -349.0, -1411.4, -1411.4, -120.0],
        "Кэшбэк": [None, None, 70.0, 70.0, None],
        "Категория": ["Пополнения", "Канцтовары", "Ж/д билеты", "Ж/д билеты", "Фастфуд"],
        "Описание": ["Пополнение через Газпромбанк", "Mitrankov M.V.", "РЖД", "РЖД", "Mouse Tail"],
        "Дата платежа": ["30.12.2021", "30.12.2021", "30.12.2021", "30.12.2021", "29.12.2021"],
        "Сумма платежа": [174000.0, -349.0, -1411.4, -1411.4, -120.0],
        "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB"],
        "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB"],
        "MCC": [None, 5943.0, 4112.0, 4112.0, 5814.0],
        "Бонусы (включая кэшбэк)": [0, 6, 70, 70, 1],
        "Округление на инвесткопилку": [0, 0, 0, 0, 0],
        "Сумма операции с округлением": [174000.0, 349.0, 1411.4, 1411.4, 120.0],
    }

    df = pd.DataFrame(data)
    df["Дата операции"] = pd.to_datetime(df["Дата операции"], format="%d.%m.%Y %H:%M:%S", errors="coerce")
    df["Дата платежа"] = pd.to_datetime(df["Дата платежа"], format="%d.%m.%Y", errors="coerce")

    return df


# Фикстура для пустого DataFrame
@pytest.fixture
def empty_operations_data() -> pd.DataFrame:
    return pd.DataFrame()


@pytest.fixture
def operations_data_list() -> list:
    return [
        {"Дата операции": "2021-12-01 16:44:00", "Категория": "Супермаркеты", "Кэшбэк": 30, "Сумма операции": -100.0},
        {"Дата операции": "2021-12-15 16:42:00", "Категория": "Супермаркеты", "Кэшбэк": 25, "Сумма операции": -200.0},
        {"Дата операции": "2021-12-25 18:45:50", "Категория": "Аптеки", "Кэшбэк": 15, "Сумма операции": -50.0},
        {"Дата операции": "2021-11-30 15:44:00", "Категория": "Фастфуд", "Кэшбэк": 50, "Сумма операции": -100.0},
        {"Дата операции": "2021-10-30 01:23:00", "Категория": "Фастфуд", "Кэшбэк": 5, "Сумма операции": -20.0},
    ]


@pytest.fixture
def empty_operations_data_list() -> list:
    return []


# Фикстура для пустого DataFrame
@pytest.fixture
def empty_transactions_data() -> pd.DataFrame:
    # Создаем пустой DataFrame с необходимыми столбцами
    return pd.DataFrame(columns=["Дата операции", "Категория", "Сумма операции", "Сумма платежа", "Описание"])
